app/controllers/watchlists_controller.rb

  def index
    @watchlists = Watchlist.all
---
SELECT "watchlists".* FROM "watchlists"

    def set_watchlist
      @watchlist = Watchlist.find(params[:id])
---
SELECT "watchlists".* FROM "watchlists" WHERE "watchlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]